In [1]:
import pandas as pd

In [7]:
df = pd.read_csv('G:\INeuron_data_science_assignment\po.csv')

In [8]:
df.head()

,id,name,nametype,recclass,mass,year,reclat,reclong,coordinates
0,1,Aachen,Valid,L5,21.0,1880-01-01,50.77500,6.08333,"[6, 50]"
1,2,Aarhus,Valid,H6,720.0,1951-01-01,56.18333,10.23333,"[10, 56]"
2,6,Abee,Valid,EH4,107000.0,1952-01-01,54.21667,-113.00000,"[-113, 54]"
3,10,Acapulco,Valid,Acapulcoite,1914.0,1976-01-01,16.88333,-99.90000,"[-99, 16]"
4,370,Achiras,Valid,L6,780.0,1902-01-01,-33.16667,-64.95000,"[-64, -33]"

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 948 entries, 0 to 947
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           948 non-null    int64
 1   name         948 non-null    object
 2   nametype     948 non-null    object
 3   recclass     948 non-null    object
 4   mass         948 non-null    float64
 5   year         948 non-null    object
 6   reclat       948 non-null    float64
 7   reclong      948 non-null    float64
 8   coordinates  948 non-null    object
dtypes: float64(3), int64(1), object(5)
memory usage: 66.8+ KB

In [9]:
df.isnull().sum()

id             0
name           0
nametype       0
recclass       0
mass           0
year           0
reclat         0
reclong        0
coordinates    0
dtype: int64

 - Get all the Earth meteorites that fell before the year 2000

In [13]:
df['year'] = pd.to_datetime(df['year']) #converting to datetime

In [16]:
df[df['year'].dt.year <2000]['name']

0         Aachen
1         Aarhus
2           Abee
3       Acapulco
4        Achiras
         ...
942     Timochin
943     Tirupati
945        Tjabe
946     Tjerebon
947    Tomakovka
Name: name, Length: 882, dtype: object

- Get all the earth meteorites co-ordinates who fell before the year 1970

In [18]:
df[df['year'].dt.year < 1970]['coordinates']

0         [6, 50]
1        [10, 56]
2      [-113, 54]
4      [-64, -33]
5        [71, 32]
          ...
942      [35, 54]
943      [79, 13]
945     [111, -7]
946     [106, -6]
947      [34, 47]
Name: coordinates, Length: 739, dtype: object

- Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more
than 10000kg

In [20]:
df[df['mass']>10000]['name']

2            Abee
7            Agen
11            AÃ¯r
15        Akyumak
26     Alfianello
          ...
939     Tieschitz
940        Tilden
942      Timochin
945         Tjabe
946      Tjerebon
Name: name, Length: 237, dtype: object